{
  "app.title": "Haolei QR ကုဒ် ထုတ်လုပ်သူ",
  "app.subtitle": "အင်တာနက်မလို • မတင်ကြား • API မလို • ၁၀၀% လိုကယ်",
  "label.text": "စာသား သို့မဟုတ် လင့်ခ်",
  "placeholder.text": "လင့်ခ်၊ စာသား သို့မဟုတ် ဝိုင်ဖိုင် အချက်အလက် ထည့်ပါ",
  "label.size": "အရွယ်အစား",
  "label.foreground": "အရှေ့အရောင်",
  "label.background": "နောက်ခံအရောင်",
  "label.format": "ဒေါင်းလုပ် ဖော်မတ်",
  "nav.generator": "ထုတ်လုပ်သူ",
  "nav.about": "အကြောင်း",
  "nav.privacy": "ကိုယ်ရေးကိုယ်တာ",
  "nav.language": "ဘာသာစကား",
  "format.png": "PNG (ပုံမှန်)",
  "format.svg": "SVG",
  "format.pdf": "PDF",
  "format.jpg": "JPG",
  "format.webp": "WEBP",
  "action.generate": "QR ဖန်တီးရန်",
  "action.download": "{format} ဒေါင်းလုပ်",
  "preview.title": "တိုက်ရိုက် မြင်ကွင်း",
  "preview.subtitle": "ရေးသလို အလိုအလျောက် ပြောင်းလဲမည်",
  "preview.placeholder": "သင်၏ QR ကုဒ်ကို ဒီမှာ ပြမည်",
  "status.ready": "ပြုလုပ်ရန် အဆင်သင့်",
  "status.addContent": "ပြုလုပ်ရန် အကြောင်းအရာ ထည့်ပါ",
  "status.qrReady": "QR အဆင်သင့်",
  "cookies.title": "ကွတ်ကီးများ နှင့် နှစ်သက်မှု",
  "cookies.body": "သင်၏ နှစ်သက်မှုနှင့် လက်ခံချက်ကို မှတ်သားရန် ကွတ်ကီးများကို အသုံးပြုသည်။ အသုံးပြုရန် လက်ခံရပါမည်။",
  "cookies.item1": "အရွယ်အစားနှင့် အရောင်များကို မှတ်သား",
  "cookies.item2": "ဒေါင်းလုပ် ဖော်မတ်ကို မှတ်သား",
  "cookies.item3": "အပြင်ဆင်ဦးစားပေးမှုကို မှတ်သား",
  "cookies.item4": "သဘောတူညီမှုရွေးချက်ချက်ကို သိုလှောင်",
  "cookies.accept": "လက်ခံပြီး ရှေ့တိုးရန်",
  "footer.cookies": "ကွတ်ကီးများ",
  "footer.privacy": "ကိုယ်ရေးကိုယ်တာ မူဝါဒ",
  "footer.about": "အကြောင်း",
  "footer.copyright": "© 2026 Laitei. မူပိုင်ခွင့်များ သိမ်းဆည်းထားသည်။",
  "privacy.title": "ကိုယ်ရေးကိုယ်တာ မူဝါဒ",
  "privacy.effective": "အတည်ပြုရက် - ဖေဖော်ဝါရီ ၅၊ ၂၀၂၆",
  "privacy.overview.title": "အကျဉ်းချုပ်",
  "privacy.overview.body": "Haolei QR ကုဒ် ထုတ်လုပ်သူသည် အော့ဖ်လိုင်းပထမ ကိုယ်တိုင်လုပ်ဆောင်သော ကိရိယာ ဖြစ်သည်။ QR ထုတ်လုပ်ခြင်းသည် သင့်ဘရောက်ဇာထဲတွင်ပင် ဖြစ်သည်။ သင့်ဒေတာကို ဆာဗာသို့ မပို့ပါ။",
  "privacy.data.title": "ကျွန်ုပ်တို့ ဆောင်ရွက်သော ဒေတာ",
  "privacy.data.item1": "ထည့်သည့် အကြောင်းအရာ - သင်ထည့်သော စာသား သို့မဟုတ် လင့်ခ် ကို ဒေသတွင်းတွင် QR အဖြစ် ပြောင်းလဲသည်။",
  "privacy.data.item2": "ဦးစားပေးရွေးချယ်မှုများ - သင်၏ အရွယ်အစား၊ အရောင်၊ ပုံစံနှင့် သတ်မှတ်ချက် ရွေးချယ်မှုများကို သင့်စက်ပစ္စည်းပေါ်ရှိ ကွတ်ကီးများတွင် ကျွန်ုပ်တို့ သိမ်းဆည်းထားပါသည်။",
  "privacy.cookies.title": "ကွတ်ကီးများ",
  "privacy.cookies.body": "ကွကီးများသည် သင့်နှစ်သက်မှုနှင့် လက်ခံချက်ကိုသာ မှတ်သားရန် ဖြစ်ပြီး ခြေရာခံခြင်း မပြုလုပ်ပါ။",
  "privacy.third.title": "ပြင်ပစာကြည့်တိုက်များ",
  "privacy.third.body": "ဤဆိုက်တွင် QRCode.js နှင့် jsPDF ကို အများသုံး CDN များမှ တင်သွင်းပြီး အသုံးပြုထားသည်။",
  "privacy.choice.title": "သင့်ရွေးချယ်မှုများ",
  "privacy.choice.body": "ဘရောက်ဇာဆက်တင်မှ ကွတ်ကီးများကို ဖျက်နိုင်သည်။ ထို့နောက် နှစ်သက်မှုနှင့် လက်ခံချက်များ ပြန်လည်သတ်မှတ်မည်။",
  "privacy.contact.title": "ဆက်သွယ်ရန်",
  "about.title": "Haolei QR ကုဒ် ထုတ်လုပ်သူ အကြောင်း",
  "about.subtitle": "အော့ဖ်လိုင်းပထမ QR ထုတ်လုပ်မှုနှင့် မော်ဒန် UX",
  "about.what.title": "လုပ်ပေးသည့်အရာ",
  "about.what.body": "ဘရောက်ဇာတွင် ချက်ချင်း QR ကို ထုတ်လုပ်ပေးသည်။ အင်တာနက်မရှိသည့်အချိန်တွင်ပါ လုပ်ဆောင်နိုင်သည်။",
  "about.offline.title": "အင်တာနက်မရှိဘဲ အသုံးပြုနိုင်သည် — Service Worker Cache ဖြင့် ပံ့ပိုးထားသည်။",
  "about.offline.intro": "Haolei QR Code Generator ကို အော့ဖ်လိုင်းအပြည့်အဝအသုံးပြုနိုင်သော Progressive Web App (PWA) အဖြစ် တည်ဆောက်ထားပါသည်။ သင်သည် ဤဝဘ်ဆိုက်သို့ ပထမဆုံးအကြိမ် ဝင်ရောက်ကြည့်ရှုပြီးသည်နှင့် လိုအပ်သော အချက်အလက်ဖိုင်အားလုံးကို Service Worker အသုံးပြု၍ သင့်စက်ပစ္စည်းပေါ်တွင် အလိုအလျောက် သိမ်းဆည်းပေးမည် ဖြစ်ပါသည်။",
  "about.offline.how.title": "အလုပ်လုပ်ပုံ",
  "about.offline.how.body": "သင် ဤအက်ပ် ကို ပထမဆုံးအကြိမ် ဖွင့်လိုက်သည်နှင့် Service Worker သည် နောက်ကွယ်မှနေ၍ အလိုအလျောက် အလုပ်လုပ်သွားပြီး HTML စာမျက်နှာများ၊ Stylesheets များ၊ Scripts များ၊ ဘာသာပြန်ဖိုင်များနှင့် အက်ပ်၏ လိုဂို တို့ကို မှတ်သားသိမ်းဆည်း ထားလိုက်မည် ဖြစ်သည်။ ထိုသို့ ပထမဆုံးအကြိမ် ဝင်ရောက်ပြီးနောက်တွင် အင်တာနက် လုံးဝမလိုဘဲ အက်ပ်တစ်ခုလုံးကို သင့်ဘရောက်ဇာ ၏ Cache ထဲမှတစ်ဆင့် အသုံးပြုနိုင်မည် ဖြစ်သည်။",
  "about.offline.what.title": "သိမ်းဆည်းထားသည့် အချက်အလက်များ",
  "about.offline.item1": "စာမျက်နှာအားလုံး - QR ဖန်တီးခြင်း၊ အကြောင်း နှင့် ကိုယ်ရေးအချက်အလက် လုံခြုံမှု",
  "about.offline.item2": "လုပ်ဆောင်ချက်များ အပြည့်အဝရရှိစေရန် Stylesheets နှင့် Scripts များ",
  "about.offline.item3": "ရရှိနိုင်သော ဘာသာစကားအားလုံး (အင်္ဂလိပ်၊ မရာ၊ မြန်မာ) အတွက် ဘာသာပြန်ဖိုင်များ",
  "about.offline.item4": "အက်ပ်၏ လိုဂိုနှင့် အိုင်ကွန်",
  "about.offline.strategy.title": "စမတ်ကျသော ဒေတာသိမ်းဆည်းမှု ဗျူဟာ",
  "about.offline.strategy.body": "ဤအက်ပ်သည် စာမျက်နှာများအတွက် အင်တာနက်-ပထမ ဗျူဟာကို အသုံးပြုပြီး အရင်းအမြစ်ဖိုင် များအတွက် Cache-first ဗျူဟာကို အသုံးပြုထားပါသည်။ ထို့ကြောင့် အင်တာနက်ရှိနေချိန်တွင် နောက်ဆုံးထွက်ဗားရှင်းကို အမြဲရရှိနိုင်မည်ဖြစ်ပြီး အင်တာနက်လိုင်းပြတ်တောက်သွားချိန်တွင်လည်း အဆင်ပြေချောမွေ့စွာ ဆက်လက်အသုံးပြုနိုင်မည် ဖြစ်သည်။ ဗားရှင်းအသစ် ထွက်ရှိတိုင်းတွင်လည်း သိမ်းဆည်းထားသော အချက်အလက် (Cache) များသည် အလိုအလျောက် အဆင့်မြှင့်တင်သွားမည် ဖြစ်သည်။",
  "about.offline.benefit.title": "အရေးကြီးရသည့်အချက်",
  "about.offline.benefit.body": "သင်သည် လေယာဉ်ပေါ်၌ ရောက်ရှိနေချိန်ဖြစ်စေ၊ အင်တာနက်လိုင်းမရှိသော ဝေးလံခေါင်ဖျားသည့် အရပ်ဒေသတွင် ဖြစ်စေ၊ သို့မဟုတ် အင်တာနက်တုံ့ပြန်မှုကို စောင့်ဆိုင်းနေစရာမလိုဘဲ လျင်မြန်သော အတွေ့အကြုံကို လိုချင်သည်ဖြစ်စေ Haolei QR Code Generator ကို အဆင်သင့် အသုံးပြုနိုင်ပါသည်။ မည်သည့်ဆော့ဖ်ဝဲကိုမျှ ထည့်သွင်းရန် မလိုအပ်ပါ — ဝဘ်ဆိုက်သို့ တစ်ကြိမ်ဝင်ရောက်ရုံဖြင့် အရာအားလုံး အဆင်သင့် ဖြစ်သွားပါပြီ။",
  "about.why.title": "ဘာကြောင့် အရေးကြီးသည်",
  "about.why.body": "သင့်ဒေတာသည် သင့်စက်တွင်ပဲ ရှိနေပြီး ခြေရာခံခြင်း မရှိပါ။",
  "about.open.title": "အဖွင့်ရင်းမြစ်",
  "about.open.body": "MIT လိုင်စင်ဖြင့် ဖွင့်ထားပြီး သင့်လိုအပ်ချက်အတွက် ပြင်ဆင်လွယ်ကူသည်။",
  "about.contact.title": "ဆက်သွယ်ရန်",
  "language.label": "ဘာသာစကား",
  "langpick.title": "Choose Your Language",
  "langpick.body": "Select your preferred language to continue.",
  "langpick.confirm": "Continue",
  "lang.en": "English",
  "lang.mrh": "Mara (MRH)",
  "lang.my": "Burmese",
  "lang.en.name": "English",
  "lang.mrh.name": "Mara",
  "lang.my.name": "မြန်မာ"
}
