{
  "app.title": "Haolei QR ကုဒ် ထုတ်လုပ်သူ",
  "app.subtitle": "အင်တာနက်မလို • မတင်ကြား • API မလို • အပြည့်အစုံ လိုကယ်",
  "label.text": "စာသား သို့မဟုတ် URL",
  "placeholder.text": "လင့်ခ်၊ စာသား သို့မဟုတ် Wi‑Fi အချက်အလက် ထည့်ပါ",
  "label.size": "အရွယ်အစား",
  "label.foreground": "အရှေ့အရောင်",
  "label.background": "နောက်ခံအရောင်",
  "label.format": "ဒေါင်းလုပ် ဖော်မတ်",
  "nav.generator": "Generator",
  "nav.about": "About",
  "nav.privacy": "Privacy",
  "nav.language": "Language",
  "format.png": "PNG (ပုံမှန်)",
  "format.svg": "SVG",
  "format.pdf": "PDF",
  "format.jpg": "JPG",
  "format.webp": "WEBP",
  "action.generate": "QR တည်ဆောက်ရန်",
  "action.download": "{format} ဒေါင်းလုပ်",
  "preview.title": "တိုက်ရိုက် မြင်ကွင်း",
  "preview.subtitle": "ရေးသလို အလိုအလျောက် ပြောင်းလဲမည်",
  "preview.placeholder": "သင်၏ QR ကုဒ်ကို ဒီမှာ ပြမည်",
  "status.ready": "တည်ဆောက်ရန် အဆင်သင့်",
  "status.addContent": "တည်ဆောက်ရန် အကြောင်းအရာ ထည့်ပါ",
  "status.qrReady": "QR အဆင်သင့်",
  "cookies.title": "ကွကီးများ နှင့် နှစ်သက်မှု",
  "cookies.body": "သင်၏ နှစ်သက်မှုနှင့် လက်ခံချက်ကို မှတ်သားရန် ကွကီးများကို အသုံးပြုသည်။ အသုံးပြုရန် လက်ခံရပါမည်။",
  "cookies.item1": "အရွယ်အစားနှင့် အရောင်များကို မှတ်သား",
  "cookies.item2": "ဒေါင်းလုပ် ဖော်မတ်ကို မှတ်သား",
  "cookies.item3": "Remember theme preference",
  "cookies.item4": "Store consent choice",
  "cookies.accept": "လက်ခံပြီး ဆက်လက်လုပ်ဆောင်ရန်",
  "footer.cookies": "ကွကီးများ",
  "footer.privacy": "ကိုယ်ရေးကိုယ်တာ မူဝါဒ",
  "footer.about": "အကြောင်းအရာ",
  "footer.copyright": "© 2026 Laitei. မူပိုင်ခွင့်များ သိမ်းဆည်းထားသည်။",
  "privacy.title": "ကိုယ်ရေးကိုယ်တာ မူဝါဒ",
  "privacy.effective": "တည်ရက်: 2026 ဖေဖော်ဝါရီ 5",
  "privacy.overview.title": "အကျဉ်းချုပ်",
  "privacy.overview.body": "Haolei QR ကုဒ် ထုတ်လုပ်သူသည် အော့ဖ်လိုင်းပထမ ကိုယ်တိုင်လုပ်ဆောင်သော ကိရိယာ ဖြစ်သည်။ QR ထုတ်လုပ်ခြင်းသည် သင့်ဘရောက်ဇာထဲတွင်ပင် ဖြစ်သည်။ သင့်ဒေတာကို ဆာဗာသို့ မပို့ပါ။",
  "privacy.data.title": "ကျွန်ုပ်တို့ ကုသိုလ်ယူသော ဒေတာ",
  "privacy.data.item1": "အကြောင်းအရာ: သင်ထည့်သော စာသား သို့မဟုတ် URL ကို ဒေသတွင်းတွင် QR အဖြစ် ပြောင်းလဲသည်။",
  "privacy.data.item2": "Preferences: We store your size, color, format, and theme preferences in cookies on your device.",
  "privacy.cookies.title": "ကွကီးများ",
  "privacy.cookies.body": "ကွကီးများသည် သင့်နှစ်သက်မှုနှင့် လက်ခံချက်ကိုသာ မှတ်သားရန် ဖြစ်ပြီး ခြေရာခံခြင်း မပြုလုပ်ပါ။",
  "privacy.third.title": "ပြင်ပစာကြည့်တိုက်များ",
  "privacy.third.body": "ဤဆိုက်တွင် QRCode.js နှင့် jsPDF ကို အများသုံး CDN များမှ တင်သွင်းပြီး အသုံးပြုထားသည်။",
  "privacy.choice.title": "သင့်ရွေးချယ်မှု",
  "privacy.choice.body": "ဘရောက်ဇာဆက်တင်မှ ကွကီးများကို ဖျက်နိုင်သည်။ ထို့နောက် နှစ်သက်မှုနှင့် လက်ခံချက်များ ပြန်လည်သတ်မှတ်မည်။",
  "privacy.contact.title": "ဆက်သွယ်ရန်",
  "about.title": "Haolei QR ကုဒ် ထုတ်လုပ်သူ အကြောင်း",
  "about.subtitle": "အော့ဖ်လိုင်းပထမ QR ထုတ်လုပ်မှုနှင့် မော်ဒန် UX",
  "about.what.title": "ဘာလုပ်ပေးသည်",
  "about.what.body": "ဘရောက်ဇာတွင် ချက်ချင်း QR ကို ထုတ်လုပ်ပေးသည်။ အင်တာနက်မရှိသည့်အချိန်တွင်ပါ လုပ်ဆောင်နိုင်သည်။",
  "about.offline.title": "အော့ဖ်လိုင်းတွင် အလုပ်လုပ်သည် — Service Worker Cache ဖြင့်",
  "about.offline.intro": "Haolei QR Code Generator သည် အပြည့်အဝ အော့ဖ်လိုင်း ပံ့ပိုးမှုရှိသော Progressive Web App (PWA) အဖြစ် တည်ဆောက်ထားသည်။ ပထမဆုံးအကြိမ် ဆိုက်သို့ ဝင်ရောက်သည်နှင့် မရှိမဖြစ်လိုအပ်သော ဖိုင်များအားလုံးကို Service Worker ဖြင့် သင့်စက်တွင် အလိုအလျောက် သိမ်းဆည်းပေးသည်။",
  "about.offline.how.title": "အလုပ်လုပ်ပုံ",
  "about.offline.how.body": "အက်ပ်ကို ပထမဆုံးအကြိမ် ဖွင့်သောအခါ Service Worker သည် နောက်ကွယ်တွင် တပ်ဆင်ပြီး HTML စာမျက်နှာများ၊ stylesheets များ၊ scripts များ၊ ဘာသာပြန်ဖိုင်များနှင့် အက်ပ် logo ကို သိမ်းဆည်းသည်။ ထိုပထမအကြိမ် ဝင်ရောက်ပြီးနောက် အက်ပ်တစ်ခုလုံးကို အင်တာနက်ချိတ်ဆက်မှု မလိုဘဲ အသုံးပြုနိုင်သည်။",
  "about.offline.what.title": "ဘာတွေ သိမ်းဆည်းသည်",
  "about.offline.item1": "စာမျက်နှာအားလုံး: Generator၊ About နှင့် Privacy",
  "about.offline.item2": "လုပ်ဆောင်ချက် အပြည့်အစုံအတွက် Stylesheets နှင့် scripts များ",
  "about.offline.item3": "ပံ့ပိုးထားသော ဘာသာစကားအားလုံးအတွက် ဘာသာပြန်ဖိုင်များ (English, Mara, Burmese)",
  "about.offline.item4": "အက်ပ် logo နှင့် icon",
  "about.offline.strategy.title": "စမတ် သိမ်းဆည်းမှု နည်းဗျူဟာ",
  "about.offline.strategy.body": "အက်ပ်သည် စာမျက်နှာများအတွက် network-first နည်းဗျူဟာနှင့် assets များအတွက် cache-first နည်းဗျူဟာ အသုံးပြုသည်။ အွန်လိုင်းဖြစ်သောအခါ နောက်ဆုံးဗားရှင်းကို ရရှိပြီး ချိတ်ဆက်မှု ပြတ်တောက်သောအခါလည်း ချောမွေ့စွာ အလုပ်လုပ်ဆဲ ဖြစ်သည်။ ဗားရှင်းသစ် တင်တိုင်း cache အလိုအလျောက် အပ်ဒိတ်ဖြစ်သည်။",
  "about.offline.benefit.title": "ဘာကြောင့် အရေးကြီးသည်",
  "about.offline.benefit.body": "လေယာဉ်ပေါ်တွင်ဖြစ်စေ၊ အချက်ပြမှုမရှိသော နေရာဝေးတွင်ဖြစ်စေ၊ ကွန်ရက်တောင်းဆိုမှု မစောင့်ဘဲ မြန်ဆန်သော အတွေ့အကြုံ လိုချင်ရုံဖြစ်စေ Haolei QR Code Generator သည် အသုံးပြုရန် အဆင်သင့်ဖြစ်သည်။ ထည့်သွင်းစရာ မလိုပါ — တစ်ကြိမ် ဝင်ရောက်ရုံဖြင့် အဆင်သင့်ဖြစ်သည်။",
  "about.why.title": "ဘာကြောင့် အရေးကြီးသည်",
  "about.why.body": "သင့်ဒေတာသည် သင့်စက်တွင်ပဲ ရှိနေပြီး ခြေရာခံခြင်း မရှိပါ။",
  "about.open.title": "အဖွင့်ရင်းမြစ်",
  "about.open.body": "MIT လိုင်စင်ဖြင့် ဖွင့်ထားပြီး သင့်လိုအပ်ချက်အတွက် ပြင်ဆင်လွယ်ကူသည်။",
  "about.contact.title": "ဆက်သွယ်ရန်",
  "language.label": "ဘာသာစကား"
}
