{
  "app.title": "Haolei QR ကုဒ် ထုတ်လုပ်သူ",
  "app.subtitle": "အင်တာနက်မလို • မတင်ကြား • API မလို • ၁၀၀% လိုကယ်",
  "label.text": "စာသား သို့မဟုတ် လင့်ခ်",
  "placeholder.text": "လင့်ခ်၊ စာသား သို့မဟုတ် ဝိုင်ဖိုင် အချက်အလက် ထည့်ပါ",
  "app.title": "Haolei QR ကုဒ် ဖန်တီးရာ",
  "app.subtitle": "အင်တာနက် မလို • Upload မလုပ် • API မသုံး • အပြည့်အဝ Local ဖြစ်သည်",
  "label.text": "စာသား သို့မဟုတ် URL",
  "placeholder.text": "လင့်ခ်၊ စာသား သို့မဟုတ် Wi‑Fi အချက်အလက် ထည့်ပါ",
  "label.size": "အရွယ်အစား",
  "label.foreground": "QR အရောင်",
  "label.background": "နောက်ခံအရောင်",
  "label.format": "ဒေါင်းလုပ် ဖော်မတ်",
  "nav.generator": "ထုတ်လုပ်သူ",
  "nav.about": "အကြောင်း",
  "nav.privacy": "ကိုယ်ရေးကိုယ်တာ",
  "nav.generator": "QR ဖန်တီးရန်",
  "nav.about": "အကြောင်းအရာ",
  "nav.privacy": "ကိုယ်ရေးမူဝါဒ",
  "nav.language": "ဘာသာစကား",
  "format.png": "PNG (ပုံမှန်)",
  "format.svg": "SVG",
  "format.pdf": "PDF",
  "format.jpg": "JPG",
  "format.webp": "WEBP",
  "action.generate": "QR ဖန်တီးရန်",
  "action.download": "{format} ဒေါင်းလုပ်",
  "preview.title": "တိုက်ရိုက် မြင်ကွင်း",
  "preview.subtitle": "ရေးသလို အလိုအလျောက် ပြောင်းလဲမည်",
  "preview.placeholder": "သင်၏ QR ကုဒ်ကို ဒီမှာ ပြမည်",
  "status.ready": "ပြုလုပ်ရန် အဆင်သင့်",
  "status.addContent": "ပြုလုပ်ရန် အကြောင်းအရာ ထည့်ပါ",
  "status.qrReady": "QR အဆင်သင့်",
  "cookies.title": "ကွတ်ကီးများ နှင့် နှစ်သက်မှု",
  "cookies.body": "သင်၏ နှစ်သက်မှုနှင့် လက်ခံချက်ကို မှတ်သားရန် ကွတ်ကီးများကို အသုံးပြုသည်။ အသုံးပြုရန် လက်ခံရပါမည်။",
  "cookies.item1": "အရွယ်အစားနှင့် အရောင်များကို မှတ်သား",
  "cookies.item2": "ဒေါင်းလုပ် ဖော်မတ်ကို မှတ်သား",
  "cookies.item3": "အပြင်ဆင်ဦးစားပေးမှုကို မှတ်သား",
  "cookies.item4": "သဘောတူညီမှုရွေးချက်ချက်ကို သိုလှောင်",
  "cookies.accept": "လက်ခံပြီး ရှေ့တိုးရန်",
  "footer.cookies": "ကွတ်ကီးများ",
  "footer.privacy": "ကိုယ်ရေးကိုယ်တာ မူဝါဒ",
  "footer.about": "အကြောင်း",
  "footer.copyright": "© 2026 Laitei. မူပိုင်ခွင့်များ သိမ်းဆည်းထားသည်။",
  "privacy.title": "ကိုယ်ရေးကိုယ်တာ မူဝါဒ",
  "privacy.effective": "အတည်ပြုရက် - ဖေဖော်ဝါရီ ၅၊ ၂၀၂၆",
  "privacy.overview.title": "အကျဉ်းချုပ်",
  "privacy.overview.body": "Haolei QR ကုဒ် ထုတ်လုပ်သူသည် အော့ဖ်လိုင်းပထမ ကိုယ်တိုင်လုပ်ဆောင်သော ကိရိယာ ဖြစ်သည်။ QR ထုတ်လုပ်ခြင်းသည် သင့်ဘရောက်ဇာထဲတွင်ပင် ဖြစ်သည်။ သင့်ဒေတာကို ဆာဗာသို့ မပို့ပါ။",
  "privacy.data.title": "ကျွန်ုပ်တို့ ဆောင်ရွက်သော ဒေတာ",
  "privacy.data.item1": "ထည့်သည့် အကြောင်းအရာ - သင်ထည့်သော စာသား သို့မဟုတ် လင့်ခ် ကို ဒေသတွင်းတွင် QR အဖြစ် ပြောင်းလဲသည်။",
  "privacy.data.item2": "ဦးစားပေးရွေးချယ်မှုများ - သင်၏ အရွယ်အစား၊ အရောင်၊ ပုံစံနှင့် သတ်မှတ်ချက် ရွေးချယ်မှုများကို သင့်စက်ပစ္စည်းပေါ်ရှိ ကွတ်ကီးများတွင် ကျွန်ုပ်တို့ သိမ်းဆည်းထားပါသည်။",
  "privacy.cookies.title": "ကွတ်ကီးများ",
  "privacy.cookies.body": "ကွကီးများသည် သင့်နှစ်သက်မှုနှင့် လက်ခံချက်ကိုသာ မှတ်သားရန် ဖြစ်ပြီး ခြေရာခံခြင်း မပြုလုပ်ပါ။",
  "privacy.third.title": "ပြင်ပစာကြည့်တိုက်များ",
  "privacy.third.body": "ဤဆိုက်တွင် QRCode.js နှင့် jsPDF ကို အများသုံး CDN များမှ တင်သွင်းပြီး အသုံးပြုထားသည်။",
  "privacy.choice.title": "သင့်ရွေးချယ်မှုများ",
  "privacy.choice.body": "ဘရောက်ဇာဆက်တင်မှ ကွတ်ကီးများကို ဖျက်နိုင်သည်။ ထို့နောက် နှစ်သက်မှုနှင့် လက်ခံချက်များ ပြန်လည်သတ်မှတ်မည်။",
  "privacy.contact.title": "ဆက်သွယ်ရန်",
  "about.title": "Haolei QR ကုဒ် ထုတ်လုပ်သူ အကြောင်း",
  "about.subtitle": "အော့ဖ်လိုင်းပထမ QR ထုတ်လုပ်မှုနှင့် မော်ဒန် UX",
  "about.what.title": "လုပ်ပေးသည့်အရာ",
  "about.what.body": "ဘရောက်ဇာတွင် ချက်ချင်း QR ကို ထုတ်လုပ်ပေးသည်။ အင်တာနက်မရှိသည့်အချိန်တွင်ပါ လုပ်ဆောင်နိုင်သည်။",
  "about.offline.title": "အင်တာနက်မရှိဘဲ အသုံးပြုနိုင်သည် — Service Worker Cache ဖြင့် ပံ့ပိုးထားသည်။",
  "about.offline.intro": "Haolei QR Code Generator ကို အော့ဖ်လိုင်းအပြည့်အဝအသုံးပြုနိုင်သော Progressive Web App (PWA) အဖြစ် တည်ဆောက်ထားပါသည်။ သင်သည် ဤဝဘ်ဆိုက်သို့ ပထမဆုံးအကြိမ် ဝင်ရောက်ကြည့်ရှုပြီးသည်နှင့် လိုအပ်သော အချက်အလက်ဖိုင်အားလုံးကို Service Worker အသုံးပြု၍ သင့်စက်ပစ္စည်းပေါ်တွင် အလိုအလျောက် သိမ်းဆည်းပေးမည် ဖြစ်ပါသည်။",
  "about.offline.how.title": "အလုပ်လုပ်ပုံ",
  "about.offline.how.body": "သင် ဤအက်ပ် ကို ပထမဆုံးအကြိမ် ဖွင့်လိုက်သည်နှင့် Service Worker သည် နောက်ကွယ်မှနေ၍ အလိုအလျောက် အလုပ်လုပ်သွားပြီး HTML စာမျက်နှာများ၊ Stylesheets များ၊ Scripts များ၊ ဘာသာပြန်ဖိုင်များနှင့် အက်ပ်၏ လိုဂို တို့ကို မှတ်သားသိမ်းဆည်း ထားလိုက်မည် ဖြစ်သည်။ ထိုသို့ ပထမဆုံးအကြိမ် ဝင်ရောက်ပြီးနောက်တွင် အင်တာနက် လုံးဝမလိုဘဲ အက်ပ်တစ်ခုလုံးကို သင့်ဘရောက်ဇာ ၏ Cache ထဲမှတစ်ဆင့် အသုံးပြုနိုင်မည် ဖြစ်သည်။",
  "about.offline.what.title": "သိမ်းဆည်းထားသည့် အချက်အလက်များ",
  "about.offline.item1": "စာမျက်နှာအားလုံး - QR ဖန်တီးခြင်း၊ အကြောင်း နှင့် ကိုယ်ရေးအချက်အလက် လုံခြုံမှု",
  "about.offline.item2": "လုပ်ဆောင်ချက်များ အပြည့်အဝရရှိစေရန် Stylesheets နှင့် Scripts များ",
  "about.offline.item3": "ရရှိနိုင်သော ဘာသာစကားအားလုံး (အင်္ဂလိပ်၊ မရာ၊ မြန်မာ) အတွက် ဘာသာပြန်ဖိုင်များ",
  "about.offline.item4": "အက်ပ်၏ လိုဂိုနှင့် အိုင်ကွန်",
  "about.offline.strategy.title": "စမတ်ကျသော ဒေတာသိမ်းဆည်းမှု ဗျူဟာ",
  "about.offline.strategy.body": "ဤအက်ပ်သည် စာမျက်နှာများအတွက် အင်တာနက်-ပထမ ဗျူဟာကို အသုံးပြုပြီး အရင်းအမြစ်ဖိုင် များအတွက် Cache-first ဗျူဟာကို အသုံးပြုထားပါသည်။ ထို့ကြောင့် အင်တာနက်ရှိနေချိန်တွင် နောက်ဆုံးထွက်ဗားရှင်းကို အမြဲရရှိနိုင်မည်ဖြစ်ပြီး အင်တာနက်လိုင်းပြတ်တောက်သွားချိန်တွင်လည်း အဆင်ပြေချောမွေ့စွာ ဆက်လက်အသုံးပြုနိုင်မည် ဖြစ်သည်။ ဗားရှင်းအသစ် ထွက်ရှိတိုင်းတွင်လည်း သိမ်းဆည်းထားသော အချက်အလက် (Cache) များသည် အလိုအလျောက် အဆင့်မြှင့်တင်သွားမည် ဖြစ်သည်။",
  "about.offline.benefit.title": "အရေးကြီးရသည့်အချက်",
  "about.offline.benefit.body": "သင်သည် လေယာဉ်ပေါ်၌ ရောက်ရှိနေချိန်ဖြစ်စေ၊ အင်တာနက်လိုင်းမရှိသော ဝေးလံခေါင်ဖျားသည့် အရပ်ဒေသတွင် ဖြစ်စေ၊ သို့မဟုတ် အင်တာနက်တုံ့ပြန်မှုကို စောင့်ဆိုင်းနေစရာမလိုဘဲ လျင်မြန်သော အတွေ့အကြုံကို လိုချင်သည်ဖြစ်စေ Haolei QR Code Generator ကို အဆင်သင့် အသုံးပြုနိုင်ပါသည်။ မည်သည့်ဆော့ဖ်ဝဲကိုမျှ ထည့်သွင်းရန် မလိုအပ်ပါ — ဝဘ်ဆိုက်သို့ တစ်ကြိမ်ဝင်ရောက်ရုံဖြင့် အရာအားလုံး အဆင်သင့် ဖြစ်သွားပါပြီ။",
  "about.why.title": "ဘာကြောင့် အရေးကြီးသည်",
  "about.why.body": "သင့်ဒေတာသည် သင့်စက်တွင်ပဲ ရှိနေပြီး ခြေရာခံခြင်း မရှိပါ။",
  "about.open.title": "အဖွင့်ရင်းမြစ်",
  "about.open.body": "MIT လိုင်စင်ဖြင့် ဖွင့်ထားပြီး သင့်လိုအပ်ချက်အတွက် ပြင်ဆင်လွယ်ကူသည်။",
  "about.contact.title": "ဆက်သွယ်ရန်",
  "language.label": "ဘာသာစကား",
  "langpick.title": "Choose Your Language",
  "langpick.body": "Select your preferred language to continue.",
  "langpick.confirm": "Continue",
  "lang.en": "English",
  "lang.mrh": "Mara (MRH)",
  "lang.my": "Burmese",
  "action.generate": "QR ကုဒ် ဖန်တီးမယ်",
  "action.download": "{format} ဒေါင်းလုပ်ရယူမယ်",
  "preview.title": "လက်တွေ့ မြင်ကွင်း",
  "preview.subtitle": "ရိုက်ထည့်လိုက်တာနဲ့ အလိုအလျောက် ပြောင်းလဲပေးပါမယ်",
  "preview.placeholder": "သင့် QR ကုဒ် ဒီနေရာမှာ ပေါ်လာပါမယ်",
  "status.ready": "ဖန်တီးရန် အဆင်သင့်",
  "status.addContent": "ဖန်တီးရန် စာသား သို့မဟုတ် လင့်ခ် ထည့်ပါ",
  "status.qrReady": "QR ကုဒ် ရပါပြီ",
  "cookies.title": "Cookies နှင့် စိတ်ကြိုက်ရွေးချယ်မှုများ",
  "cookies.body": "သင်၏ theme နဲ့ setting များကို မှတ်သားထားရန် cookies အသုံးပြုထားပါတယ်။ ဆက်လက်အသုံးပြုလိုပါက လက်ခံပေးပါ။",
  "cookies.item1": "အရွယ်အစားနှင့် အရောင်များကို မှတ်သားရန်",
  "cookies.item2": "ဒေါင်းလုပ် ဖော်မတ်ကို မှတ်သားရန်",
  "cookies.item3": "Theme အပြင်အဆင်ကို မှတ်သားရန်",
  "cookies.item4": "လက်ခံချက်ကို မှတ်သားရန်",
  "cookies.accept": "လက်ခံပြီး ဆက်လက်လုပ်ဆောင်မယ်",
  "footer.cookies": "Cookies",
  "footer.privacy": "ကိုယ်ရေးကိုယ်တာ မူဝါဒ",
  "footer.about": "အကြောင်းအရာ",
  "footer.copyright": "© 2026 Laitei. မူပိုင်ခွင့် ရယူထားသည်။",
  "privacy.title": "ကိုယ်ရေးကိုယ်တာ မူဝါဒ",
  "privacy.effective": "စတင်အသက်ဝင်သည့်ရက်: ၂၀၂၆ ဖေဖော်ဝါရီ ၅",
  "privacy.overview.title": "အကျဉ်းချုပ်",
  "privacy.overview.body": "Haolei QR ကုဒ် ဖန်တီးရာသည် Offline-first (အင်တာနက်မလိုဘဲ ဦးစားပေးလုပ်ဆောင်သော) tool တစ်ခုဖြစ်ပါတယ်။ QR ကုဒ် ဖန်တီးခြင်းကို သင့် browser ထဲမှာပဲ လုပ်ဆောင်ပေးတာဖြစ်ပြီး သင့် data တွေကို server ဆီ ပို့ဆောင်ခြင်း မရှိပါဘူး။",
  "privacy.data.title": "ကျွန်ုပ်တို့ ရယူသော Data များ",
  "privacy.data.item1": "အကြောင်းအရာ: သင်ထည့်လိုက်သော စာသား သို့မဟုတ် URL ကို သင့်စက်ထဲမှာပဲ QR အဖြစ် ပြောင်းလဲပေးပါတယ်။",
  "privacy.data.item2": "စိတ်ကြိုက်ရွေးချယ်မှုများ: အရွယ်အစား၊ အရောင်၊ ဖော်မတ် နှင့် theme များကို သင့်စက်ရဲ့ Cookie ထဲမှာပဲ သိမ်းဆည်းပါတယ်။",
  "privacy.cookies.title": "Cookies",
  "privacy.cookies.body": "Cookies တွေကို သင့်ရွေးချယ်မှုများ (Preferences) မှတ်သားဖို့အတွက်သာ သုံးထားပြီး ခြေရာခံခြင်း (Tracking) မပြုလုပ်ပါ။",
  "privacy.third.title": "ပြင်ပ Libraries များ",
  "privacy.third.body": "ဒီ site မှာ QRCode.js နဲ့ jsPDF ကို အများသုံး CDN များမှတဆင့် ရယူအသုံးပြုထားပါတယ်။",
  "privacy.choice.title": "သင့်ရွေးချယ်ခွင့်",
  "privacy.choice.body": "Browser setting မှတဆင့် cookies များကို ဖျက်နိုင်ပါတယ်။ ဖျက်လိုက်ပါက မှတ်သားထားသော setting များကို ပြန်စရပါမယ်။",
  "privacy.contact.title": "ဆက်သွယ်ရန်",
  "about.title": "Haolei QR ကုဒ် ဖန်တီးရာ အကြောင်း",
  "about.subtitle": "Offline-first QR ကုဒ် ဖန်တီးမှု နှင့် ခေတ်မီ UX",
  "about.what.title": "ဘာလုပ်ပေးနိုင်လဲ",
  "about.what.body": "Browser ထဲမှာတင် ချက်ချင်း QR ကုဒ် ထုတ်ပေးနိုင်ပါတယ်။ အင်တာနက် မရှိချိန်မှာလည်း အသုံးပြုလို့ ရပါတယ်။",
  "about.offline.title": "Offline မှာ အလုပ်လုပ်ပုံ — Service Worker Cache",
  "about.offline.intro": "Haolei QR Code Generator ကို Progressive Web App (PWA) တစ်ခုအနေနဲ့ တည်ဆောက်ထားပါတယ်။ ဆိုက်ကို စဝင်လိုက်တာနဲ့ service worker က လိုအပ်တဲ့ ဖိုင်တွေအားလုံးကို သင့်စက်ထဲမှာ အလိုအလျောက် သိမ်းဆည်းထားလိုက်ပါတယ်။",
  "about.offline.how.title": "ဘယ်လို အလုပ်လုပ်လဲ",
  "about.offline.how.body": "Service Worker က နောက်ကွယ်မှာ HTML ၊ stylesheets၊ scripts၊ ဘာသာပြန်ဖိုင်တွေနဲ့ logo တွေကို သိမ်းဆည်း (Cache) ပေးထားပါတယ်။ ဒါကြောင့် နောက်တစ်ခါ ဝင်တဲ့အခါ အင်တာနက် မရှိရင်တောင် အက်ပ်တစ်ခုလုံးကို ချက်ချင်း သုံးလို့ရနေမှာ ဖြစ်ပါတယ်။",
  "about.offline.what.title": "ဘာတွေ သိမ်းဆည်းထားလဲ",
  "about.offline.item1": "စာမျက်နှာများ: Generator၊ About နှင့် Privacy",
  "about.offline.item2": "Stylesheets နှင့် script ဖိုင်များ",
  "about.offline.item3": "ဘာသာပြန်ဖိုင်များ (English, Mara, မြန်မာ)",
  "about.offline.item4": "အက်ပ် Logo နှင့် icon များ",
  "about.offline.strategy.title": "Smart Caching စနစ်",
  "about.offline.strategy.body": "စာမျက်နှာတွေအတွက် Network-first နဲ့ Assets တွေအတွက် Cache-first စနစ်ကို သုံးထားပါတယ်။ အွန်လိုင်းဖြစ်နေရင် version အသစ်ကို ရယူပြီး၊ အင်တာနက်လိုင်း ကျသွားရင်လည်း အဆင်ပြေပြေ ဆက်သုံးလို့ ရပါမယ်။ Update အသစ်ရှိရင် Cache ကို အလိုအလျောက် မွမ်းမံပေးပါတယ်။",
  "about.offline.benefit.title": "ဘာကြောင့် ကောင်းတာလဲ",
  "about.offline.benefit.body": "လေယာဉ်ပေါ်မှာပဲဖြစ်ဖြစ်၊ လိုင်းမကောင်းတဲ့ နေရာမှာပဲဖြစ်ဖြစ်၊ loading စောင့်စရာမလိုဘဲ မြန်မြန်ဆန်ဆန် သုံးချင်ရင် Haolei QR Code Generator က အသင့်ရှိနေမှာပါ။ Install လုပ်စရာမလိုဘဲ တစ်ကြိမ်ဝင်ထားရုံနဲ့ အဆင်ပြေပါတယ်။",
  "about.why.title": "ဘာကြောင့် သုံးသင့်လဲ",
  "about.why.body": "သင့် Data တွေက သင့်စက်ထဲမှာပဲ ရှိနေပြီး ဘယ်သူမှ ခြေရာခံမကြည့်နိုင်လို့ပါ။",
  "about.open.title": "Open Source",
  "about.open.body": "MIT License နဲ့ Open Source ပေးထားလို့ လိုအပ်သလို လွတ်လပ်စွာ ပြင်ဆင်အသုံးပြုနိုင်ပါတယ်။",
  "about.contact.title": "ဆက်သွယ်ရန်",
  "language.label": "ဘာသာစကား",
  "langpick.title": "ဘာသာစကား ရွေးချယ်ပါ",
  "langpick.body": "ဆက်လက်လုပ်ဆောင်ရန် သင့်ဘာသာစကားကို ရွေးချယ်ပါ။",
  "langpick.confirm": "ဆက်လက်လုပ်ဆောင်မယ်",
  "lang.en": "English",
  "lang.mrh": "Mara",
  "lang.my": "မြန်မာ",
  "lang.en.name": "English",
  "lang.mrh.name": "Mara",
  "lang.my.name": "မြန်မာ"
}
